# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 6  # number of classes
scales: 
  n: [0.33, 0.25, 1024]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, PatchEmbed, [128, 4, 4]]  # 0-P1/2
  - [-1, 1, FasterNetBlock, [128, 1, 4]]  # 1-P2/4
  - [-1, 1, PatchMerging, [256, 2, 2]]
  - [-1, 2, FasterNetBlock, [256, 2, 4]]  # 3-P3/8
  - [-1, 1, PatchMerging, [512, 2, 2]]
  - [-1, 13, FasterNetBlock, [512, 13, 4]]  # 5-P4/16
  - [-1, 1, PatchMerging, [1024, 2, 2]]
  - [-1, 2, FasterNetBlock, [1024, 2, 4]]  # 7-P5/32
  - [-1, 1, SPPF, [1024, 5]]  # 8

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)

