# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 6  # number of classes
scales: 
  n: [0.33, 0.25, 1024]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  - [-1, 1, stem, [64, 3, 2]] 
  - [-1, 2, FusedMBConv, [64, 3, 1, 1, 0]]  # P1

  - [-1, 1, FusedMBConv, [128, 3, 2, 4, 0]] 
  - [-1, 3, FusedMBConv, [128, 3, 1, 4, 0]]  #P2

  - [-1, 1, FusedMBConv, [256, 3, 2, 4, 0]] 
  - [-1, 3, FusedMBConv, [256, 3, 1, 4, 0]] #P3

  - [-1, 1, MBConv, [512, 3, 2, 4, 0.25]] 
  - [-1, 5, MBConv, [512, 3, 1, 4, 0.25]]
  
  - [-1, 1, MBConv, [1024, 3, 1, 4, 0.25]]  
  - [-1, 8, MBConv, [1024, 3, 1, 6, 0.25]] # P4

  - [-1, 1, MBConv, [1024, 3, 2, 6, 0.25]] 
  - [-1, 14, MBConv, [1024, 3, 1, 6, 0.25]] 

  - [-1, 1, SPPF, [1024, 5]]  # 12 P5

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]  # Detect(P3, P4, P5)
